# Estadistica Aplicada

Sesion 4, 14 de agosto

Jesus Adrian Cordero Hernandez 1952778

In [1]:
# Lista
Lista1 = ['Jaime', 'Pedro', 'Maria']

In [2]:
Lista1.append('Jimena')

In [3]:
# Tupla
tupla1 = (23, 45, 'libro')

In [4]:
type(tupla1)

tuple

In [5]:
tupla1.append('pluma')

AttributeError: 'tuple' object has no attribute 'append'

La principal caracteristica de una tupla es que es inmutable (no se puede modificar)

Diccionarios (mapeos de valores)

Un diccionario es un par de clave-valor

In [6]:
alumno_dic = {'Nombre':'Juan', 'Apellido':'Perez', 'Edad':'21'}

In [7]:
alumno_dic['Nombre']

'Juan'

In [8]:
alumno_dic['Edad']

'21'

In [9]:
## Accedemos a las variables que son las claves o las keys
alumno_dic.keys()

dict_keys(['Nombre', 'Apellido', 'Edad'])

In [10]:
alumno_dic.values()

dict_values(['Juan', 'Perez', '21'])

In [11]:
# Crear un diccionario de los alumnos del grupo
estadistica_g41 = {'Nombre':['Juan', 'Sebas', 'Sorely'], 'Edad':[15,16,17]}

In [12]:
estadistica_g41.keys()

dict_keys(['Nombre', 'Edad'])

In [13]:
estadistica_g41.values()

dict_values([['Juan', 'Sebas', 'Sorely'], [15, 16, 17]])

## Pandas 
Se utiliza para manipular datos estructurados. Y esta construida sobre numpy eso significa que cualquier funcion de numpy funciona en pandas. En pandas hay 3 estructuras de datos
1. Series (unidimensionales)
2. Dataframes (dtos en filas y columnas)
3. Paneles (tiempo)

Supongamos que conocemos las edades de las siguientes personas: Juan:10, Pedro:20, Jorge:30, Ale:40 y Alba:50

In [15]:
edades = [10, 20, 30, 40, 50]

In [16]:
import pandas as pd

In [17]:
serie1 = pd.Series(edades, index=['Juan','Pedro', 'Jorge','Ale', 'Alba'])

In [18]:
serie1

Juan     10
Pedro    20
Jorge    30
Ale      40
Alba     50
dtype: int64

In [19]:
serie1.mean()

30.0

In [21]:
serie1.std()

15.811388300841896

## Dataframes 
Datos en filas y columnas

In [23]:
alumno1 = ['Juan','Perez', 23]
alumno2 = ['Raul','Gonzales',17]
alumno3 = ['Jimena','Rosas',20]
alumno4 = ['Alejandra','Saldaña',21]

In [24]:
clase_estadistica = [alumno1, alumno2, alumno3, alumno4]

In [25]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzales', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [27]:
df_clase = pd.DataFrame(clase_estadistica, columns=['Nombre','Apellido','Edad'])

In [28]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzales    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [29]:
type(df_clase)

pandas.core.frame.DataFrame

In [30]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [31]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [32]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzales    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [33]:
df_clase['Estado'] = ['Nuevo Leon','Cohauila','Nuevo Leon','Veracruz']

In [34]:
df_clase

      Nombre  Apellido  Edad      Estado
0       Juan     Perez    23  Nuevo Leon
1       Raul  Gonzales    17    Cohauila
2     Jimena     Rosas    20  Nuevo Leon
3  Alejandra   Saldaña    21    Veracruz

In [35]:
df_clase = df_clase.set_index('Nombre')

In [36]:
df_clase

           Apellido  Edad      Estado
Nombre
Juan          Perez    23  Nuevo Leon
Raul       Gonzales    17    Cohauila
Jimena        Rosas    20  Nuevo Leon
Alejandra   Saldaña    21    Veracruz

In [37]:
df_clase['Edad en dias'] = df_clase['Edad']*365

In [38]:
df_clase

           Apellido  Edad      Estado  Edad en dias
Nombre
Juan          Perez    23  Nuevo Leon          8395
Raul       Gonzales    17    Cohauila          6205
Jimena        Rosas    20  Nuevo Leon          7300
Alejandra   Saldaña    21    Veracruz          7665

In [39]:
df_clase['Edad en meses'] = df_clase['Edad']*12

In [40]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzales    17    Cohauila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

## Seleccion en dataframes
1. Elecciones estandar 
2. iloc
3. loc
4. boleanos

In [41]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzales    17    Cohauila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

In [42]:
# Seleccion estandar
df_clase['Apellido']

Nombre
Juan            Perez
Raul         Gonzales
Jimena          Rosas
Alejandra     Saldaña
Name: Apellido, dtype: object

In [44]:
df_clase[['Apellido','Edad']]

           Apellido  Edad
Nombre
Juan          Perez    23
Raul       Gonzales    17
Jimena        Rosas    20
Alejandra   Saldaña    21

In [45]:
df_clase[0:2]

        Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan       Perez    23  Nuevo Leon          8395            276
Raul    Gonzales    17    Cohauila          6205            204

In [47]:
# elegir columna edad, filas 0,1
df_clase[0:2][['Edad','Apellido']]

        Edad  Apellido
Nombre
Juan      23     Perez
Raul      17  Gonzales

Seleccion por posicion o por i.iloc


daraframe.iloc[filas, columnas]

In [48]:
df_clase.iloc[0:2, 1]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

In [49]:
df_clase.iloc[:, 1]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## Seleccion por etiquetas o .loc

dataframe.loc[filas, columnas]

In [50]:
df_clase.loc[:, 'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [51]:
df_clase.loc['Juan','Edad']

23

In [52]:
edad_juan = df_clase.loc['Juan','Edad']

## Seleccion con condicionales (boleanos)

In [53]:
df_clase[df_clase['Edad']>20]

          Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan         Perez    23  Nuevo Leon          8395            276
Alejandra  Saldaña    21    Veracruz          7665            252

In [55]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzales    17    Cohauila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

In [58]:
df_clase['Edad'].mean()

20.25

In [59]:
df_clase['Edad'].std()

2.5

In [61]:
df_clase['Edad'].sum()

81

In [62]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzales    17    Cohauila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

In [64]:
import numpy as np

np.where(condicion, valor si se cumple, valor )

In [65]:
df_clase['Mayor de edad'] = np.where(df_clase['Edad']>=18, 'Mayor de edad', 'Menor de edad')

In [66]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad
Nombre,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad
Raul,Gonzales,17,Cohauila,6205,204,Menor de edad
Jimena,Rosas,20,Nuevo Leon,7300,240,Mayor de edad
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad

# np.select
np.select(condiciones, valor para cada condicion, valor si no se cumple ninguna condicion)

In [69]:
condiciones = [df_clase['Edad']<=17,
               df_clase['Edad']<23,
               df_clase['Edad']>=23]
valor_condicion = ['Prepa','Licen','Egresado']
df_clase['condicion de estudio'] = np.select(condiciones, valor_condicion, default='invalido')

In [70]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,condicion de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad,Egresado
Raul,Gonzales,17,Cohauila,6205,204,Menor de edad,Prepa
Jimena,Rosas,20,Nuevo Leon,7300,240,Mayor de edad,Licen
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licen

In [72]:
df_clase['Edad'].count()

4

In [73]:
df_clase.value_counts('Mayor de edad')

Mayor de edad
Mayor de edad    3
Menor de edad    1
dtype: int64

In [74]:
df_clase.value_counts('condicion de estudio')

condicion de estudio
Licen       2
Egresado    1
Prepa       1
dtype: int64

In [77]:
df_clase.groupby('Mayor de edad').mean().round(1) ['Edad']

C:\Users\Dell\AppData\Local\Temp\ipykernel_9336\1763670714.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_clase.groupby('Mayor de edad').mean().round(1) ['Edad']

Mayor de edad
Mayor de edad    21.3
Menor de edad    17.0
Name: Edad, dtype: float64

In [79]:
#aggregate agg
df_clase.agg(['count', 'mean'])

C:\Users\Dell\AppData\Local\Temp\ipykernel_9336\509503712.py:2: FutureWarning: ['Apellido', 'Estado', 'Mayor de edad', 'condicion de estudio'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_clase.agg(['count', 'mean'])

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,condicion de estudio
count,4.0,4.00,4.0,4.00,4.0,4.0,4.0
mean,NaN,20.25,NaN,7391.25,243.0,NaN,NaN

In [80]:
## query 
df_clase.query('Edad>20')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,condicion de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad,Egresado
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licen

In [83]:
## Seleccionar a alejandra
df_clase.query('Nombre=="Alejandra"')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,condicion de estudio
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licen

In [85]:
## seleccionar a alejandra y los que sean mayores de 20
df_clase.query('Nombre=="Alejandra" & Edad>20')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,condicion de estudio
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licen

In [87]:
calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [89]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [90]:
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [92]:
calificaciones.shape

(28, 4)

In [93]:
calificaciones.head(10)

   Id            Nombre   Apellido  Calficación Final
0   1           ANTONIO     GARCIA                 73
1   2            MANUEL  FERNANDEZ                 19
2   3              JOSE   GONZALEZ                 38
3   4             DAVID      PEREZ                 14
4   5              JUAN      LOPEZ                 99
5   6      JOSE ANTONIO  RODRIGUEZ                 66
6   7            JAVIER    SANCHEZ                 46
7   8         JOSE LUIS      GOMEZ                 89
8   9  FRANCISCO JAVIER    JIMENEZ                 10
9  10            CARLOS       RUIZ                 62

In [94]:
calificaciones.tail(5)

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [99]:
## vamos a elegir todas las columnas menos id
calificaciones = calificaciones.loc[:, calificaciones.columns!= 'Id']

In [100]:
calificaciones

              Nombre   Apellido  Calficación Final
0            ANTONIO     GARCIA                 73
1             MANUEL  FERNANDEZ                 19
2               JOSE   GONZALEZ                 38
3              DAVID      PEREZ                 14
4               JUAN      LOPEZ                 99
5       JOSE ANTONIO  RODRIGUEZ                 66
6             JAVIER    SANCHEZ                 46
7          JOSE LUIS      GOMEZ                 89
8   FRANCISCO JAVIER    JIMENEZ                 10
9             CARLOS       RUIZ                 62
10             JESUS     ALONSO                 94
11         ALEJANDRO  HERNANDEZ                 17
12            MIGUEL       DIAZ                 85
13       JOSE MANUEL  GUTIERREZ                 34
14            RAFAEL    ALVAREZ                 86
15      MIGUEL ANGEL     MORENO                100
16             PEDRO      MUÑOZ                  1
17             PABLO     BLANCO                 64
18             ANGEL        GIL                100
19            SERGIO    AGUIRRE                  2
20        JOSE MARIA       DIEZ                 29
21          FERNANDO    SALAZAR                 51
22             JORGE      RAMOS                 76
23              LUIS  DOMINGUEZ                 12
24           ALBERTO      ORTIZ                 99
25       JUAN CARLOS     IBAÑEZ                 43
26            ALVARO    RAMIREZ                 40
27            ADRIAN       SAEZ                  7

In [110]:
# renombrar 
calificaciones = calificaciones.rename(columns={'Calficación Final':'CalFinal'})

In [123]:
calificaciones

              Nombre   Apellido  CalFinal  Aprobados  situacion Situaciones
0            ANTONIO     GARCIA        73   Aprobado   Aprobado    Aprobado
1             MANUEL  FERNANDEZ        19  Reprobado  Reprobado   Reprobado
2               JOSE   GONZALEZ        38  Reprobado  Reprobado   Reprobado
3              DAVID      PEREZ        14  Reprobado  Reprobado   Reprobado
4               JUAN      LOPEZ        99   Aprobado   Aprobado    Aprobado
5       JOSE ANTONIO  RODRIGUEZ        66  Reprobado  Reprobado   Reprobado
6             JAVIER    SANCHEZ        46  Reprobado  Reprobado   Reprobado
7          JOSE LUIS      GOMEZ        89   Aprobado   Aprobado    Aprobado
8   FRANCISCO JAVIER    JIMENEZ        10  Reprobado  Reprobado   Reprobado
9             CARLOS       RUIZ        62  Reprobado  Reprobado   Reprobado
10             JESUS     ALONSO        94   Aprobado   Aprobado    Aprobado
11         ALEJANDRO  HERNANDEZ        17  Reprobado  Reprobado   Reprobado
12            MIGUEL       DIAZ        85   Aprobado   Aprobado    Aprobado
13       JOSE MANUEL  GUTIERREZ        34  Reprobado  Reprobado   Reprobado
14            RAFAEL    ALVAREZ        86   Aprobado   Aprobado    Aprobado
15      MIGUEL ANGEL     MORENO       100   Aprobado   Aprobado    Aprobado
16             PEDRO      MUÑOZ         1  Reprobado  Reprobado   Reprobado
17             PABLO     BLANCO        64  Reprobado  Reprobado   Reprobado
18             ANGEL        GIL       100   Aprobado   Aprobado    Aprobado
19            SERGIO    AGUIRRE         2  Reprobado  Reprobado   Reprobado
20        JOSE MARIA       DIEZ        29  Reprobado  Reprobado   Reprobado
21          FERNANDO    SALAZAR        51  Reprobado  Reprobado   Reprobado
22             JORGE      RAMOS        76   Aprobado   Aprobado    Aprobado
23              LUIS  DOMINGUEZ        12  Reprobado  Reprobado   Reprobado
24           ALBERTO      ORTIZ        99   Aprobado   Aprobado    Aprobado
25       JUAN CARLOS     IBAÑEZ        43  Reprobado  Reprobado   Reprobado
26            ALVARO    RAMIREZ        40  Reprobado  Reprobado   Reprobado
27            ADRIAN       SAEZ         7  Reprobado  Reprobado   Reprobado

In [122]:
calificaciones['Situaciones']= np.where(calificaciones['CalFinal']>=70, 'Aprobado', 'Reprobado')

In [124]:
situacion.value(['Aprobado', 'Reprobado'])

AttributeError: 'numpy.ndarray' object has no attribute 'value'